* Company

#+begin_src emacs-lisp
(setq company-minimum-prefix-length 2
      company-idle-delay 0.3) ;; default is 0.2

(add-hook 'after-init-hook 'global-company-mode)
(add-hook 'company-mode-hook 'company-box-mode)
#+end_src

#+RESULTS:
| company-mode-set-explicitly | company-box-mode |

